/* < 배열 정렬하기 >
 * 	20 10 40 50 30
 * 	=> DESC(내림차순) 50 40 30 20 10
 * 	=> ASC(올림차순) 10 20 30 40 50 
 * 
 * 	1. 선택정렬 (왼쪽)
 * 	   20 10 40 50 30 
 * 	   ==
 *        ==
 *     10  20 
 *     ==  ==
 *     10    40
 *     ==    ==
 *     10     50 
 *     ==      == 
 *     10       30
 *     ============= 1 round
 * 	   10 20 40 50 30 
 * 		  == ==
 *  	  20 40 
 *  	  ==  ==
 *        20  50
 *        ==   ==
 *        20   30
 *     ============= 2 round
 *     10 20 40 50 30 
 *     		 == ==
 *           40 50 
 *           ==   ==
 *           30 50 40
 *     ============== 3 round
 *     10 20 30 50 40 
 *     			== ==
 *     			40 50 
 *     ============== 4 round
 *     10 20 30 40 50
 *      
 *   2.  버블정렬	=> 옆에 있는 것과 비교
 *   	 20 10 40 50 30 
 *       == ==
 *       10 20 
 *       	== ==
 *       	20 40 
 *             == ==
 *             40 50 
 *                == ==
 *                30 50 
 *      ==================
 *      10 20 40 30 50 
 *      == == 
 *      10 20 
 *         == ==
 *         20 40  
 *            == ==
 *            30 40 
 *      =================
 *      10 20 30 40 50  
 *      == == 
 *      10 20 
 *         == == 
 *         20 30 
 *      ===============
 *      10 20 30 40 50 
 *      == == 
 *      10 20 
 *      ===============
 *      10 20 30 40 50 	  
 */				  
public class 배열_정렬하기 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		int[] arr= {30,10,40,20,50}; // ASC => DESC
		System.out.println("정렬전:");
		for(int i:arr) {
			System.out.print(i+" ");
		}
		System.out.println("\n정렬후:"); // 윗칸 띄려고 \n 썼음
		
		// 선택 정렬 ==> 왼쪽 고정 ==> 맨마지막까지 검색
		/*	int a=10;
		 *  int b=20;
		 * 		==> a=20 , b=10
		 *  a=b; ==> a=20
		 *  b=a; ==> b=20
		 *  
		 *  int temp=a;
		 *  	a=b;
		 *  	===
		 *  	20 ==> a=20;
		 *  b=temp;
		 */
		for(int i=0;i<arr.length-1;i++) {
			for(int j=i+1;j<arr.length;j++) {
				if(arr[i]>arr[j]) {
					int temp=arr[i]; // 임시변수 -> temp 없으면 그 전 값이 지워짐
					arr[i]=arr[j];
					arr[j]=temp;
				}
			}
		}
		// 정렬
		for(int i:arr) {
			System.out.print(i+" ");
		}
		
	}

}